//*********************************************************************
/*!
	@file	iruna_sphere.h
	@brief	当たり判定用球
	@author	立川 翔野
	@date	2011/11/13	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_SPHERE_H
#define IRUNA_SPHERE_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//!=====================================================================
//!
//! @struct	Sphere
//! @brief	球構造体
//!
//!=====================================================================
struct Sphere
{
//	パブリックメンバ変数
public:

	math::Vector3	origin;		//!< 球の中心
	float			radius;		//!< 球の半径

//	パブリックメンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Sphere();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ(中心点と半径を設定する)
	//! @param	[in] setOrigin	- 球の中心
	//! @param	[in] setRadius	- 球の半径
	//! 
	//!--------------------------------------------------------------------
	Sphere(  math::Vector3 setOrigin, float setRadius );

	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Sphere();

};

}	//	geometry	end
}	//	iruna		end

#endif	//	IRUNA_SPHERE_H	end