//*********************************************************************
/*!
	@file	iruna_line.h
	@brief	当たり判定用線分
	@author	立川 翔野
	@date	2011/11/13	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_SEGMENT_H
#define IRUNA_SEGMENT_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{
//!=====================================================================
//!
//! @struct	Segment
//! @brief	当たり判定用線分
//!
//!=====================================================================
struct Segment
{
public:

	math::Vector3	strat;		//!< ラインの始点
	math::Vector3	end;		//!< ラインの終点

public:

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Segment();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ(中心点と各軸の幅で初期化)
	//! @param	[in] start		- 線分の始点
	//! @param	[in] end		- 線分の終点
	//! 
	//!--------------------------------------------------------------------
	Segment( math::Vector3 start, math::Vector3 end );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Segment();
};

}	//	geometry	end
}	//	iruna		end


#endif	//	IRUNA_SEGMENT_H	end