//*********************************************************************
/*!
	@file	iruna_model_types.h
	@brief	モデルタイプ群
	@author	立川 翔野
	@date	2012/06/12 	- 作成
*/
//*********************************************************************
#ifndef IRUNA_MODEL_TYPES_H
#define IRUNA_MODEL_TYPES_H

//!=====================================================================
//!
//! @enum	対応しているモデルタイプ一覧
//!
//!=====================================================================
enum ModelTypes
{
	Fbx,		//	FBX
	Pmd,		//	PMD
	Sgd			//	SGD(独自ファイル)
};

//*********************************************************************
/*!
	@brief	FBXファイルはアニメーションまで読み込めます。
	@brief	PMDファイルはアニメーションまで読み込め、IKまで使用できます。
	@brief	ですが、フルボディIKまでは実装していません。
*/
//*********************************************************************

#endif	//	IRUNA_MODEL_TYPES_H	end