//*********************************************************************
/*!
	@file	iruna_font.h
	@brief	文字テクスチャ
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_FONT_H
#define IRUNA_FONT_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_texture.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace graphics
{

//!=====================================================================
//!
//! @class	Font
//! @brief	文字テクスチャ管理クラス
//!
//!=====================================================================
class Font
{
//	パブリック	型定義
public:
	// 文字の設定の構造体
	typedef	LOGFONT	Style;

//	プライベート	型定義
private:
	// 文字テクスチャを文字ごとにmapで格納する
	typedef std::map< std::string , Texture* >	FontMap;

//	プライベート	メンバ変数
private:
	Style		style;	//!< 作成する文字のスタイル
	FontMap		pool;	//!< 文字テクスチャプール

//	パブリック		メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! @param	[in] size	- 文字のサイズ
	//! @param	[in] type	- 文字の書式
	//! 
	//!--------------------------------------------------------------------
	Font( U_INT size, LPCSTR type );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Font();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	プールから文字テクスチャを取得する、なければ作成しプールに追加する
	//! @param	[in] str	- テクスチャを取得したい文字
	//! @retval	文字テクスチャ　失敗した場合は0	
	//! 
	//!--------------------------------------------------------------------
	Texture*	GetTexture(	LPCSTR str );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	プールから文字サイズを取得する、なければ x：0　y：0 を返す	
	//! @param	[in] str	- サイズを取得したい文字
	//! @retval	文字サイズ　失敗した場合は　x：0　y：0	
	//! 
	//!--------------------------------------------------------------------
	POINT		GetSize( LPCSTR str );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	設定されている文字の書式を取得
	//! @retval	文字の書式	
	//! 
	//!--------------------------------------------------------------------
	Style		GetStyle();
};

}	//	graphics	end
}	//	iruna		end

#endif //	IRUNA_IRUNA_H	end
