//*********************************************************************
/*!
	@file	iruna_vector3.h
	@brief	3次元ベクトル関連
	@author	立川 翔野
	@date	2011/06/23	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR3_H
#define IRUNA_VECTOR3_H

namespace iruna
{
namespace math
{

//!=====================================================================
//!
//! @class	Vector3
//! @brief	
//!
//!=====================================================================
typedef	D3DXVECTOR3	Vector3;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR3_H	end