//*********************************************************************
/*!
	@file	iruna_vertex_buffer.h
	@brief	頂点バッファをラップ
	@author	立川 翔野
	@date	2011/06/23	- 作成
	@date	2012/12/31	- 更新　DirectX11仕様に変更　コピー禁止しました。→将来的には必要かもしれない
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VERTEX_BUFFER_H
#define IRUNA_VERTEX_BUFFER_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace graphics
{

//!=====================================================================
//!
//! @class	VertexBuffer
//! @brief	頂点バッファ
//!
//!=====================================================================
class VertexBuffer
{
//	プライベート	メンバ変数
private:
	ID3D11Buffer*				m_pcBuffer;		//!<	頂点バッファ
	D3D11_BUFFER_DESC			m_cBufferDesc;	//!<	頂点バッファ設定情報
	D3D11_SUBRESOURCE_DATA		m_cInitData;	//!<	頂点バッファの初期化方法
	UINT						m_nStride;		//!<	頂点１個分のサイズ

// ●プライベート	メンバ関数
private:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	頂点バッファを作成する
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	CreateVertexBuffer();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コピーコンストラクタ(コピー禁止)
	//! 
	//!--------------------------------------------------------------------
	VertexBuffer( const VertexBuffer& another );

// ●パブリック		メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	VertexBuffer();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~VertexBuffer();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	バッファを作成し、フォーマット等をとっておく
	//! @param	[in] nBufferSize	- 頂点バッファのサイズ
	//! @param	[in] vertexCount	- 頂点の数
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	Create( int nBufferSize, int nVertexCount );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	バッファに書き込む
	//! @param	[in] data		- 書き込むデータ
	//! @param	[in] begin		- 何番目の頂点から書き込むか
	//! @param	[in] end		- 何番目の頂点まで書き込むか
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	SetBuffer( const void* data );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	バッファをストリームに流す
	//! @param	[in] streamNum	- 流すストリームの番号
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	IntoStream( U_LONG streamNum );


	//!--------------------------------------------------------------------
	//! 
	//! @brief	バッファを解放する
	//! 
	//!--------------------------------------------------------------------
	void	Release();
};

}	//	graphics	end
}	//	iruna		end

#endif	//	IRUNA_VERTEX_BUFFER_H	end