//*********************************************************************
/*!
	@file	iruna_frame_rate_manage.h
	@brief	フレームレートの管理
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_FLAME_MANAGER_H
#define IRUNA_FLAME_MANAGER_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"

namespace iruna
{
namespace core
{

//!=====================================================================
//!
//! @class	FrameRateManage
//! @brief	フレームレート管理クラス(モノステート)
//!
//!=====================================================================
class FrameRateManage
{
// プライベート	メンバ変数
private:
	static U_LONG		standardOneMS;	//!< 1フレーム何㍉秒にするか
	static float		standardFps;	//!< 1秒何フレームにするか
	static float		secondAverage;	//!< 1秒で何フレームだったか

// パブリック	メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	FrameRateManage();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~FrameRateManage();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	フレームパーセコンドの設定する(静的メンバ関数)
	//! @param	[in] setFps	- 指定のフレームパーセコンド
	//! 
	//!--------------------------------------------------------------------
	static void		SetFrameRate( float setFps );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	1秒で何フレームだったかを取得する(静的メンバ関数)
	//! @retval	1秒での平均フレーム数
	//! 
	//!--------------------------------------------------------------------
	static float	GetFrameRate();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	設定したフレームパーセコンドを取得する(静的メンバ関数)
	//! @retval	設定したフレームパーセコンド
	//! 
	//!--------------------------------------------------------------------
	static float	GetStandardFrameRate();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	フレームレートを同期させる
	//! @retval	フレームレートが設定より下回っているかのフラグ true：問題なし　false：遅れている
	//! 
	//!--------------------------------------------------------------------
	static bool	Synchronization();
};

}	//	core	end
}	//	iruna	end

#endif	//	IRUNA_FLAME_MANAGER_H	end
