//*********************************************************************
/*!
	@file	iruna_line.h
	@brief	当たり判定用ライン
	@author	立川 翔野
	@date	2011/11/13	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_LINE_H
#define IRUNA_LINE_H


/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//!=====================================================================
//!
//! @struct	Line
//! @brief	ライン構造体
//!
//!=====================================================================
struct Line
{
//	パブリックメンバ変数
public:
	math::Vector3	origin;		//!< ラインの始点
	math::Vector3	normal;		//!< ラインの向き(正規化されたベクトル)

//	パブリックメンバ関数
public:

	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Line();

	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ(中心点と各軸の幅で初期化)
	//! @param	[in] setOrigin		- 線の始点
	//! @param	[in] setNormal		- 線の向き
	//! 
	//!--------------------------------------------------------------------
	Line( math::Vector3 setOrigin, math::Vector3 setNormal );

	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Line();
};

}	//	geometry	end
}	//	iruna		end

#endif	//	IRUNA_LINE_H	end