//*********************************************************************
/*!
	@file	iruna_viewport.h
	@brief	ビューポート関連
	@author	立川 翔野
	@date	2011/06/24	- 作成
	@date	2013/12/30	- 更新　DirectX11仕様に変更
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VIEWPORT_H
#define IRUNA_VIEWPORT_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_math.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace graphics
{

//!=====================================================================
//!
//! @class	Viewport
//! @brief	ビューポート、描画領域を設定する
//!
//!=====================================================================
class Viewport
{
//	プライベート	メンバ変数
private:
	D3D11_VIEWPORT	m_sViewport;	//!<	ビューポート構造体

//	パブリック		メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Viewport();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コピーコンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Viewport( const Viewport& another );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Viewport();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	ビューポートの大きさを指定する
	//! @param	[in] x		- 左上のx
	//! @param	[in] y		- 左上のy
	//! @param	[in] width	- 横幅
	//! @param	[in] height	- 高さ
	//! 
	//!--------------------------------------------------------------------
	void	SetSize( U_INT width, U_INT height );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	ビューポートの大きさを指定する(矩形版)
	//! @param	[in] rect	- 設定するビューポートの矩形
	//! 
	//!--------------------------------------------------------------------
	void	SetSize( math::Rect rect );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	ビューポートのデプスを指定する
	//! 
	//!--------------------------------------------------------------------
	void	SetDepth( float fMax, float fMin );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	ビューポートをデバイスにセット
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	SetViewport();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	代入演算子オーバーロード、D3D11_VIEWPORTをつっこめるように
	//! @param	[in] setViewport	- つっこみたいビューポート
	//! @retval	自身の参照
	//! 
	//!--------------------------------------------------------------------
	Viewport&	operator =( D3D11_VIEWPORT setViewport );
};

}	//	graphics	end
}	//	iruna		end

#endif	//	IRUNA_VIEWPORT_H	end