//*********************************************************************
/*!
	@file	iruna_model_loader.h
	@brief	指定したモデル読み込み(SGD，FBXに対応)
	@author	立川 翔野
	@date	2011/10/21	- 作成
*/
//*********************************************************************

/*----多重インクルード------------------------------------------------*/
#ifndef IRUNA_MODEL_LOADER_H
#define IRUNA_MODEL_LOADER_H

/*----インクルード------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_model_data.h"

namespace iruna
{
namespace graphics
{

/*----前方宣言------------------------------------------------*/
class	ModelDecoder;
class	AnimetionController;

//!=====================================================================
//!
//! @class	ModelLoader
//! @brief	指定したモデルの読み込み
//!
//!=====================================================================
class ModelLoader
{
private:

	ModelDecoder*			loader;					//!<	モデル読み込みクラスのポインタ
	
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	ModelLoader();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~ModelLoader();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	解放処理
	//! 
	//!--------------------------------------------------------------------
	void Relese();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	指定したモデルファイルの読み込み
	//! @param	[in] in_path			- モデルファイルのディレクトリ
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool Load( std::string in_path );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	読み込んだモデルデータの取得
	//! @retval	読み込んだモデルデータのポインタ
	//! 
	//!--------------------------------------------------------------------
	ModelData* GetModelData();

};

}	//	graphics	end
}	//	iruna		end


#endif	//	IRUNA_MODEL_LOADER_H	end