//*********************************************************************
/*!
	@file	iruna_aabb.h
	@brief	当たり判定用軸並行境界ボックス( Axis-Aligned Bounding Box )
	@author	立川 翔野
	@date	2011/11/30	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUAN_AABB_H
#define IRUAN_AABB_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_vector3.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace geometry
{

//!=====================================================================
//!
//! @struct	Aabb
//! @brief	軸並行境界ボックス構造体
//!
//!=====================================================================
struct Aabb
{
//	プライベート　メンバ変数
public:

	math::Vector3	min;	//!< 最小値の座標
	math::Vector3	max;	//!< 最大値の座標

//	プライベート	メンバ関数
public:

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Aabb();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ(中心点と各軸の幅で初期化)
	//! @param	[in] setOrigin		- 中心点
	//! @param	[in] setHalfWidths	- 各軸の幅
	//! 
	//!--------------------------------------------------------------------
	Aabb( math::Vector3 setOrigin, math::Vector3 setHalfWidths );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Aabb();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	AABBの中心点を設定する
	//! @param	[in] setOrigin		- 中心点
	//! 
	//!--------------------------------------------------------------------
	void	SetOrigin( math::Vector3 setOrigin );


	//!--------------------------------------------------------------------
	//! 
	//! @brief	AABBの中心点を取得する
	//! @retval	中心点
	//! 
	//!--------------------------------------------------------------------
	math::Vector3	GetOrigin() const;


	//!--------------------------------------------------------------------
	//! 
	//! @brief	AABBの各軸の幅を設定する
	//! @param	[in] setHalfWidths	- 各軸の幅
	//! 
	//!--------------------------------------------------------------------
	void	SetHalfWidths( math::Vector3 setHalfWidths );


	//!--------------------------------------------------------------------
	//! 
	//! @brief	AABBの各軸の幅を取得する
	//! @retval	各軸の幅
	//! 
	//!--------------------------------------------------------------------
	math::Vector3	GetHalfWidths() const;

};

}	//	geometry	end
}	//	iruna		end


#endif	//	IRUAN_AABB_H	end