//*********************************************************************
/*!
	@file	iruna_vector4.h
	@brief	4次元ベクトル関連
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR4_H
#define IRUNA_VECTOR4_H

namespace iruna
{
namespace math
{

//!=====================================================================
//!
//! @class	Vector4
//! @brief	
//!
//!=====================================================================
typedef	D3DXVECTOR4	Vector4;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR4_H	end