//*********************************************************************
/*!
	@file	iruna_quaternion.h
	@brief	クォータニオン関連
	@author	立川 翔野
	@date	2011/07/10	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_QUATERNION_H
#define IRUNA_QUATERNION_H

/*----データ型宣言-------------------------------------------------*/
namespace iruna
{
namespace math
{

//!=====================================================================
//!
//! @class	Quaternion
//! @brief	
//!
//!=====================================================================
typedef	D3DXQUATERNION 	Quaternion;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_QUATERNION_H	end