//*********************************************************************
/*!
	@file	iruna_animetion_controller.h
	@brief	モデルアニメーションクラス
	@author	立川 翔野
	@date	2012/06/14 	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_ANIMETION_CONTROLLER_H
#define IRUNA_ANIMETION_CONTROLLER_H

/*----インクルード------------------------------------------------*/
#include "../Include/iruna_model_data.h"


/*----データ型-------------------------------------------------*/
namespace iruna
{
namespace graphics
{

/*----前方宣言-------------------------------------------------*/
class AnimetionBase;

//!=====================================================================
//!
//! @class	AnimetionController
//! @brief	モデルデータのスキニングアニメーションの操作
//!
//!=====================================================================
class AnimetionController
{
private:

	AnimetionBase*	animetion;	//!<	アニメーションコントローラ
	int				foumatType;	//!<	モデルフォーマットタイプ


public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	AnimetionController();
	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~AnimetionController();
	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	スキニングアニメーションをさせるモデルデータ
	//! @param	[in] in_data			- 操作するモデルデータ
	//! 
	//!--------------------------------------------------------------------
	void SetModelData( ModelData* in_data );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	キーフレームを設定する
	//! @param	[in] flame			- 描画するフレーム
	//! 
	//!--------------------------------------------------------------------
	void SetKeyFlame( int in_flame );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	アニメーションデータを読み込む
	//! @param	[in] flame			- 描画するフレーム
	//! 
	//!--------------------------------------------------------------------
	void LoadAnimetion( std::string in_path );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	スキニングアニメーションをさせるモデルデータ
	//! @param	[in] in_data			- 操作するモデルデータ
	//! 
	//!--------------------------------------------------------------------
	void CSgdModel( math::Vector3 pos );
};

}	//	graphics	end
}	//	iruna		end
#endif	//	IRUNA_ANIMETION_CONTROLLER_H	end