//*********************************************************************
/*!
	@file	iruna_vector2.h
	@brief	2次元ベクトル関連
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_VECTOR2_H
#define IRUNA_VECTOR2_H

namespace iruna
{
namespace math
{

//!=====================================================================
//!
//! @class	Vector2
//! @brief	
//!
//!=====================================================================
typedef	D3DXVECTOR2	Vector2;

}	//	math	end
}	//	iruna	end

#endif	//	IRUNA_VECTOR2_H