//*********************************************************************
/*!
	@file	iruna_input_device.h
	@brief	インプットデバイスの管理
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_INPUT_DEVICE_H
#define IRUNA_INPUT_DEVICE_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace io
{

// 前方宣言
class Keyboard;
class Mouse;

//!=====================================================================
//!
//! @class	InputDevice
//! @brief	インプットデバイス管理クラス
//!
//!=====================================================================
class InputDevice
{
// プライベート	メンバ変数
private:
	LPDIRECTINPUT8	pDInput;	//!< ダイレクトインプット
	Keyboard*		keyboard;	//!< キーボードデバイス
	Mouse*			mouse;		//!< マウスデバイス

// パブリック	メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	InputDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~InputDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	各インプットデバイスを作成する
	//! @param	[in] hWindow	- ウィンドウハンドル
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	Create( HWND hWindow );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	各インプットデバイスを更新する
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	Update();
};

}	//	io		end
}	//	iruna	end

#endif	//	IRUNA_INPUT_DEVICE_H	end