//*********************************************************************
/*!
	@file	iruna_keyboard.h
	@brief	キーボードの管理
	@author	立川 翔野
	@date	2011/06/24	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_KEYBOARD_H
#define IRUNA_KEYBOARD_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"
#include "../Include/iruna_input_common.h"

/*----データ型 宣言------------------------------------------------*/
namespace iruna
{
namespace io
{

//!=====================================================================
//!
//! @class	Keyboard
//! @brief	キーボード管理クラス
//!
//!=====================================================================
class Keyboard
{
// プライベート	メンバ変数
private:
	LPDIRECTINPUTDEVICE8	pDIDevice;	//!< キーボードデバイス
	static BYTE*			nowState;	//!< 現在の状態(静的メンバ変数)
	static BYTE*			oldState;	//!< 前回の状態(静的メンバ変数)

// パブリック		メンバ関数
public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	Keyboard();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~Keyboard();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	キーボードデバイスを作成する
	//! @param	[in] hWindow	- ウィンドウハンドル
	//! @param	[in] pDInput	- ダイレクトインプット
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	Create( HWND hWindow, LPDIRECTINPUT8 pDInput );

	//!--------------------------------------------------------------------
	//! 
	//! @brief	キーボードデバイスを更新する
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	bool	Update();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	指定したキーの状態を返す(静的メンバ関数)
	//! @param	[in] key	- 調べたいキー
	//! @retval	押されたキーの状態
	//! 
	//!--------------------------------------------------------------------
	static INPUT_STATE	GetState( U_LONG key );
};

}	//	io		end
}	//	iruna	end


#endif	//	IRUNA_KEYBOARD_H	end