//*********************************************************************
/*!
	@file	iruna_sound_device.h
	@brief	Xaudio2の初期化と管理
	@author	立川 翔野
	@date	2011/07/09	- 作成
*/
//*********************************************************************

/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_SOUND_DEVICE_H
#define IRUNA_SOUND_DEVICE_H

/*----インクルード-------------------------------------------------*/
#include "../Include/iruna_utility.h"


/*----データ型宣言-------------------------------------------------*/
namespace iruna
{
namespace sound
{

//!=====================================================================
//!
//! @class	SoundDevice
//! @brief	Xaudio2の初期化と管理
//!
//!=====================================================================
class SoundDevice
{
private:

	static IXAudio2*					xAudio;			//!< Xaudio2のポインタ
	static IXAudio2MasteringVoice*		masterVoice;	//!< XAudio2MasteringVoiceのポインタ

public:
	//!--------------------------------------------------------------------
	//! 
	//! @brief	コンストラクタ
	//! 
	//!--------------------------------------------------------------------
	SoundDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	デストラクタ
	//! 
	//!--------------------------------------------------------------------
	~SoundDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	Xaudio2のデバイスを作成する
	//! @param	[in] speakers		- モノラルかどうかのフラグ
	//! @retval	結果フラグ	-1：失敗
	//! 
	//!--------------------------------------------------------------------
	int CreateSoundDevice( U_INT speakers );

	
	//!--------------------------------------------------------------------
	//! 
	//! @brief	作成したIXAudio2を解放する
	//! 
	//!--------------------------------------------------------------------
	void ReleaseSoundDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	作成したIXAudio2のインスタンスを取得する
	//! 
	//!--------------------------------------------------------------------
	static IXAudio2* GetDevice();

	//!--------------------------------------------------------------------
	//! 
	//! @brief	作成したIXAudio2MasteringVoiceのインスタンスを取得する
	//! 
	//!--------------------------------------------------------------------
	static IXAudio2MasteringVoice* GetMasteringVoice();


};

}	//	sound	end
}	//	iruna	end

#endif	//	IRUNA_SOUND_DEVICE_H