//*********************************************************************
/*!
	@file	iruna_animetion_base.h
	@brief	モデルアニメーションベースクラス
	@author	立川 翔野
	@date	2012/06/14 	- 作成
*/
//*********************************************************************
/*----多重インクルード防止-------------------------------------------------*/
#ifndef IRUNA_ANIMETION_BASE_H
#define IRUNA_ANIMETION_BASE_H

/*----インクルード------------------------------------------------*/
#include "../Include/iruna_model_data.h"

/*----データ型-------------------------------------------------*/
namespace iruna
{
namespace graphics
{
//!=====================================================================
//!
//! @class	AnimetionBase
//! @brief	スキニングアニメーションの操作ベースクラス
//!
//!=====================================================================
class AnimetionBase
{
protected:
public:

	//!--------------------------------------------------------------------
	//! 
	//! @brief	仮想デストラクタ
	//! 
	//!--------------------------------------------------------------------
	virtual ~AnimetionBase(){}

	//!--------------------------------------------------------------------
	//! 
	//! @brief	アニメーションを設定する
	//! @param	[in] flame			- 描画するフレーム
	//! @retval	結果フラグ	ture：成功　false：失敗
	//! 
	//!--------------------------------------------------------------------
	virtual bool SetAnimetion( int flame ) = 0;

	//!--------------------------------------------------------------------
	//! 
	//! @brief	アニメーションデータを読み込む
	//! @param	[in] in_paah			- 読み込むアニメーションデータのディレクトリ
	//! @retval	結果フラグ	0：成功　-1：失敗
	//! 
	//!--------------------------------------------------------------------
	virtual int	Load( std::string in_paah ) = 0;

	//!--------------------------------------------------------------------
	//! 
	//! @brief	モデルデータの描画
	//! @param	[in] pos			- 描画する座標
	//! 
	//!--------------------------------------------------------------------
	virtual void Render( math::Vector3 pos ) = 0;

	
};

}	//	graphics	end
}	//	iruna		end

#endif	//	IRUNA_ANIMETION_BASE_H	end